package main

import (
	"app/controller/api"
	"app/controller/crawler"
	"app/controller/log"
	"app/controller/postgres"

	_ "github.com/lib/pq"
)

func main() {
	// =======================================================================
	// データベース接続とテーブル初期化
	// =======================================================================
	err := postgres.Connect()
	if err != nil {
		return
	}
	err = postgres.InitTable()
	if err != nil {
		return
	}
	log.Info("データベース接続とテーブル初期化完了")

	// =======================================================================
	// クローリングの開始
	// =======================================================================
	log.Info("クローリング開始")
	crawler.Start()
	log.Info("クローリング完了")

	// =======================================================================
	// API サーバーを起動
	// =======================================================================
	log.Info("API サーバー起動")
	api.StartServer()
}
