package main

import (
	"app/controller/api"
	"app/controller/log"
	"app/controller/postgres"
	"app/usecase/scheduler"

	_ "github.com/lib/pq"
)

func main() {
	// =======================================================================
	// データベース接続とテーブル初期化
	// =======================================================================
	err := postgres.Connect()
	if err != nil {
		return
	}
	err = postgres.InitTable()
	if err != nil {
		return
	}
	log.Info("データベース接続とテーブル初期化完了")

	// =======================================================================
	// スケジューラーの初期化
	// =======================================================================
	log.Info("スケジューラーの初期化")
	scheduler.SchedulerStart()

	// =======================================================================
	// API サーバーを起動
	// =======================================================================
	log.Info("API サーバー起動")
	api.StartServer()
}
